[
    {
        "id": "1",
        "titlePage": "Projects",
        "firstTitleTextPart": "Design and development of a personal portfolio with React.js.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "Portfolio",
        "titleImage": "Preview",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "Presentation of my projects, skills, and experience",
        "textPresentation": "Explore my portfolio developed in React.js. I oversaw the design and implementation of the site using React.js, CSS, SASS, and HTML.",
        "listTechno": "React.js, HTML, CSS, SASS",
        "objectif": "Design a comprehensive portfolio to showcase projects, skills, CV, education, objectives, and personal information, with a smooth and attractive user experience.",
        "context": "My personal portfolio aims to showcase my achievements, skills, and professional experiences, with a focus on web design and development.",
        "work": "As the person in charge of graphic design and site development, I took care of creating React components, managing routing, implementing responsive layout for various screen sizes, creating an attractive and professional design, and hosting the site.",
        "workDetails": "Tasks included designing modular components via React.js to organize the site's content, setting up routing for seamless navigation, creating a responsive layout ensuring an optimal user experience on various devices, and fully realizing the site's graphics using CSS, SASS, and HTML.",
        "conclusion": "My personal portfolio, a result of complete realization, demonstrates my skills in web design and development. It professionally presents my projects and my journey, offering visitors an interactive and informative experience.",
        "linkSite": "#",
        "linkCode": "https://github.com/G-Etienne/production-folio",
        "linkSiteText": "Site Home",
        "linkCodeText": "View Code"
    },
    {
        "id": "2",
        "titlePage": "Projects",
        "firstTitleTextPart": "Integration of mockups and interactive elements with React.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "Kasa",
        "titleImage": "Mockups",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "Peer-to-peer housing rental application",
        "textPresentation": "Discover Kasa, a peer-to-peer housing rental application. The goal: integrate mockups and interactive elements with React for dynamic visuals.",
        "listTechno": "React.JS, HTML, CSS",
        "objectif": "The main objective of this project was the integration of mockups and elements using React.JS, allowing the creation of page visuals that are both static and dynamic. The project also included the implementation of interactive elements, as well as the use of a JSON file as a database for content.",
        "context": "Kasa, a peer-to-peer housing rental application, integrates responsive mockups and interactive elements. The site provides access to detailed information about accommodations as well as photos, enhancing the user experience.",
        "work": "In this project, I managed graphic integration, interactive elements, and used data to build a harmonious and engaging site.",
        "workDetails": "Specific tasks included using React to integrate mockups, developing reactive components for interactive elements, creating page visuals both statically and dynamically, and using a JSON file as a data source for the displayed content on the site.",
        "conclusion": "The Kasa project resulted in a peer-to-peer housing rental application with a responsive user interface, interactive elements, and smooth integration between static and dynamic visuals.",
        "linkSite": "https://g-etienne.github.io/CRA-Project-Kasa/",
        "linkCode": "https://github.com/G-Etienne/CRA-Project-Kasa",
        "linkSiteText": "Example of the site",
        "linkCodeText": "View Code"
    },
    {
        "id": "3",
        "titlePage": "Projects",
        "firstTitleTextPart": "Development of a REST API with Node.js and Express.js.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "Hot Takes API",
        "titleImage": "",
        "titleImageTwo": "",
        "titleImageThree": "#",
        "titlePresentation": "Development of a REST API for sharing spicy sauce recipes",
        "textPresentation": "Discover the Hot Takes API, The API for sharing spicy recipes. It stores data in MongoDB to manage users, likes/dislikes, creation, and modification of sauces.",
        "listTechno": "Node.js, JavaScript, Express.js, MongoDB",
        "objectif": "The main goal of this project was to design and implement a robust REST API using Node.js and Express.js. This API facilitates the management of users, operations related to sauces (like/dislike, retrieval, addition, modification, deletion), ensuring that only the user who created a sauce can modify or delete it.",
        "context": "Hot Takes is a spicy sauce sharing application, and the API development project aimed to provide the necessary backend functionality for managing users and sauces.",
        "work": "As the person in charge of the design and implementation of the REST API, including user management, authentication and authorization mechanisms, and operations related to sauces. The API integration works with MongoDB for data storage.",
        "workDetails": "The tasks involved configuring user management, implementing authentication and authorization mechanisms, creating endpoints for operations related to sauces (like, dislike, retrieval, addition, modification, deletion), and integrating the API with MongoDB for efficient data storage. Emphasis was placed on security and performance.",
        "conclusion": "The Hot Takes API project delivered a backend solution for the Hot Takes application, offering users functionality for creating their accounts and sharing, liking, and modifying sauce recipes.",
        "linkSite": "#",
        "linkCode": "https://github.com/G-Etienne/Projet6-Hot-Takes",
        "linkSiteText": "View the site",
        "linkCodeText": "View the Code"
    },
    {
        "id": "4",
        "titlePage": "Projects",
        "firstTitleTextPart": "Dynamization of content and creation of a shopping journey for sofas.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "Kanap",
        "titleImage": "Design",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "Dynamic Integration and Cart Management for the Kanap E-commerce site.",
        "textPresentation": "Explore the Kanap universe: dynamic integration and customer cart management for an optimal e-commerce experience.",
        "listTechno": "JavaScript, DOM, Local Storage, API",
        "objectif": "The Kanap project aims to dynamically display products returned by an API on the DOM using JavaScript. The goal is to allow users to choose the quantity and color of sofas, adding them to their cart, with the option to place an order.",
        "context": "Kanap, an e-commerce site specializing in online sofa sales, is a project that dynamically integrates a shopping journey, allowing users to easily purchase sofas.",
        "work": "The tasks performed include the dynamic implementation of elements returned by the API using the DOM and JavaScript. Allowing the user to select the quantity of products, choose the desired color, and add selected items to their cart. The integration of a form in the cart allows the user to place an order, triggering a request to the API to generate a unique order number.",
        "workDetails": "The details of the Kanap project include dynamic integration, data storage in the browser's local storage for a smooth user experience, data modification for greater choice freedom with the ability to remove products, dynamic display of product details, as well as form data validation and the ability to place an order with ease.",
        "conclusion": "In summary, Kanap offers an interactive user experience with smooth cart features through clever integration of the DOM, JavaScript, and the API. A comprehensive solution for the presentation, customization, and online purchase of sofas.",
        "linkSite": "#",
        "linkCode": "https://github.com/G-Etienne/Projet-Kanap---P5",
        "linkSiteText": "View the site",
        "linkCodeText": "View the Code"
    },
    {
        "id": "5",
        "titlePage": "Projects",
        "firstTitleTextPart": "Optimization of code structure and SEO (Search Engine Optimization).",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "La Panthère",
        "titleImage": "Design",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "SEO Optimization of the La Panthère website.",
        "textPresentation": "Explore the optimized website of La Panthère, with improved code, SEO, increased accessibility, and optimized performance.",
        "listTechno": "HTML, CSS, SEO Practices",
        "objectif": "Optimize the SEO and ranking of the La Panthère website by identifying and correcting non-optimized elements. The goal was to adjust tags and content to strengthen visibility and accessibility by highlighting relevant keywords.",
        "context": "The La Panthère agency aims to improve the SEO and quality of its site to increase visibility on search engines.",
        "work": "Actions taken included in-depth analysis of the site, identifying necessary improvements, and implementing targeted changes. This included adjustments to tags and content to strengthen the presence of relevant keywords. A study grouped points for improvement with recommendations, and tests assessed performance and accessibility.",
        "workDetails": "Technical adjustments involved modifications to HTML tags to reflect keywords and the reorganization of content. Performance and accessibility tests were conducted to ensure an optimal user experience.",
        "conclusion": "Structural adjustments improved accessibility, while the study and tests provided valuable insights for optimizing site performance.",
        "linkSite": "https://g-etienne.github.io/Projet-la-panthere/index.html",
        "linkCode": "https://github.com/G-Etienne/Projet-la-panthere",
        "linkSiteText": "Example of the improved site",
        "linkCodeText": "View the Code"
    },
    {
        "id": "6",
        "titlePage": "Projects",
        "firstTitleTextPart": "Integration of content and animations.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "OhMyFood",
        "titleImage": "Mockups",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "OhMyFood: Animations and Design.",
        "textPresentation": "Integration of Animations and Design for a pleasant online reservation experience.",
        "listTechno": "HTML, CSS, SASS",
        "objectif": "The Ohmyfood project aims to integrate site mockups as well as animations using HTML, CSS, and SASS. The complete design is provided from the beginning of the project; only the loader is a personal creation.",
        "context": "Ohmyfood offers online reservation and meal customization through its collaboration with partner restaurants.",
        "work": "Tasks undertaken include the integration of mockups using HTML, CSS, and SASS to ensure a faithful representation of the initial design. Animations, also implemented with these technologies, aim to make the site more interactive and engaging.",
        "workDetails": "Technically, integrating mockups requires a deep understanding of HTML, CSS, and SASS. Animations are designed to enhance the site's interactivity. The creation of the loader involves design and development skills.",
        "conclusion": "In conclusion, the Ohmyfood project successfully integrates mockups and animations using HTML, CSS, and SASS. The addition of the custom loader contributes to a more attractive user experience.",
        "linkSite": "https://g-etienne.github.io/oh-My-food-E.G/",
        "linkCode": "https://github.com/G-Etienne/oh-My-food-E.G",
        "linkSiteText": "Example of the OhMyFood site",
        "linkCodeText": "View the Code"
    },
    {
        "id": "7",
        "titlePage": "Projects",
        "firstTitleTextPart": "Integration of content and responsive design.",
        "secondTitleTextPart": "Technologies used in this project:",
        "thirdTitleTextPart": "Objectives:",
        "fourTitleTextPart": "Context:",
        "fiveTitleTextPart": "Tasks of this project:",
        "sixTitleTextPart": "Details:",
        "sevenTitleTextPart": "Conclusion:",
        "name": "Booki",
        "titleImage": "Mockups",
        "titleImageTwo": "Desktop",
        "titleImageThree": "Mobile",
        "titlePresentation": "Booki: Integration of Graphic Mockups.",
        "textPresentation": "Explore Booki, a web platform dedicated to property rental.",
        "listTechno": "HTML, CSS",
        "objectif": "The objective of this project is to integrate the graphic mockup of the Booki real estate rental site.",
        "context": "Booki is a website that allows property owners to rent them online.",
        "work": "Integrate a modern and elegant design, with a clear and concise layout.",
        "workDetails": "This project involves creating an HTML structure for the site and applying the appropriate CSS style. The site must perfectly conform to the desktop and mobile mockup.",
        "conclusion": "The project to integrate the graphic mockup for the Booki site is a relatively simple project that requires a good understanding of HTML and CSS.",
        "linkSite": "https://g-etienne.github.io/Site-Booki-Premier-Projet/#",
        "linkCode": "https://github.com/G-Etienne/Site-Booki-Premier-Projet",
        "linkSiteText": "Example of the site",
        "linkCodeText": "View the code"
    }
]
